{
	"name": "MrCeo",
	"companyTypes": ["tech, fast_food", "fashion", "car_company", "retail", "entertainment"],
	"tech": {
		"events": [
			"You have been doing trade for one year in the neighboring country. You have now realized $2,000,000 in net imports from this country. What should you do with the money accumulated from this trade?",
			"Currently interest rates are up in the bonds market. Luckily your finance department has been holding bonds worth $200,000 in the current market, available to sell. A set of financial projections has also been provided for your viewing. Will you sell the bonds?",
			"A new development has been made in your R&D Department allowing for a reduction in cost by $150 by using a new material in the computer chip. However, it was found that there are slight risks of catching a flame under high workload. Do you use the new chip?",
			"Your competitor Comp4U is going out of business. The company has been under fire for having cheap quality . Their owner has approached you about purchasing Comp4U and their hardware and software patents. Do you buy Comp4U?",
			"Your company is under fire for importing parts from a country that uses child labor. The general public is attacking the company for supporting unethical business practices and is losing revenue. Do you change manufacturers?",
			"The new logo used for one of your new services has been copyright striked. The logo is slightly different but strongly resembles the other company’s logo. This was done accidentally but the other company is now suing for copyright infringement.",
			"Some of your customers have been running into a basic bug interfering with their usage of the company’s A-23 computers. The R&D department has found a solution, but there will need to be a 2 week recall. The issue is not major and does not affect performance for everyone, but could worsen. Do you recall the computers?"
		],
		"fromevents": [
			"HQ",
			"Finance",
			"HR",
			"HQ",
			"HQ",
			"Marketing",
			"Operations"
		],
		"choices": [
			"Take the money and use it to get back your home currency in the FOREX",
			"Reinvest in the other country, increasing investments",
			"Hold it for now, choosing what to do later.",
			"Yes: Sell the Bonds at the current market price.",
			"No: Hold the Bonds for possible future use or collateral.",
			"Wait for Sale: Wait for the markets to change over time, possibly for a drop in interest rates and increase in Bond Price.",
			"Yes: Starts the use of the new chip, possibly taking a damage to reputation",
			"No: Opt out of the lower cost but definitely keep reputation",
			"Wait: Use more resources to solve the problem, which would bite down on profits for now",
			"Yes: Buy Comp4U and rebrand, gaining a new asset, profits may temporarily decrease and stay low",
			"No: Stakeholders may get upset",
			null,
			"Yes: Change the company’s primary manufacturer and release an apology to the public, profits may fall",
			"No: Keep the same manufacturer and let crisis management do its thing",
			null,
			null,
			null,
			null,
			"Yes: Recall the computers, profit probably goes down, and public rating may go up or down",
			"No: Nothing may happen, but public rating may decrease",
			null
		],
		"outcomes": [
			"The results of changing back to currency might decrease or increase profit and stakeholder but will increase reputation.",
			"Reinvestment will increase profit and stakeholder but decrease reputation.",
			"Will not change factors until chosen to move into 1 or 2. If nothing is chosen by the end of the year, your currency has a chance of being lost in the big global recession at the end of year 1.",
			"Interest rates fall after selling, meaning profit is maximized. Increased Profit and Stakeholder Approval",
			"Decreased interest rates after selling, meaning more profit could’ve been made. Still increase profit and stakeholder approval, but less than 1.",
			"No change was made to any indicators since it was not sold.",
			"You use the chip and nothing happens",
			"You use the chip and it catches fire in several computers. Your societal approval rating, profit, and stakeholder levels drop",
			"You do nothing and stakeholder decreases slightly",
			"Comp4U’s products and parts are incompatible with your current products, making the benefits of the purchase minimal, profit ratings drop significantly",
			"Your R&D team is able to incorporate Comp4U’s services into your product mix. Your profit ratings increase significantly, your stakeholder rating go up",
			null,
			"The company’s profit goes down because of new manufacturer, but the public approval rating has gone up",
			"Public approval rating drops significantly",
			null,
			"You win the court case, no bars change",
			"You lose the court case, profit drops and public approval drop",
			null,
			"You recall the computers, profit goes down, stakeholder and public approval rating goes down",
			"You recall the computers, profit and stakeholder goes down, but public approval rating goes up",
			"The bug is not major so no bar changes"
		],
		"graphs": [
			2, 3, 13, 5, 7, 8, 5, 15, 11, 9, 8, 1, 13, 4, 12, 13, 4, 16, 7, 8
		],
		"profiteffects": [
			1, -1, 0, -1, -1, 0, 1, 0, 0.5, -1, 0.4, 0.4, -0.4, -0.5, 0.5, 0.5, 1, -1, 0, 0, 0
		],
		"publicimgeffects": [
			0, -1, 0, -1, -1, 0, 1, 0, 0.5, -1, 0.4, 0.4, -0.4, -0.5, 0.5, 0.5, 1, -1, 0, 0, 0
		],
		"stakeholdereffects": [
			1, -1, 0.5, 0, -1, 0, -1, -1, 0, 1, 0, 0.5, -1, 0.4, 0.4, -0.4, -0.5, 0.5, 0.5, 1, 0
		]

	},
	"fast_food": {
		"events": [
			"A new development"
		],
		"fromevents": [],
		"choices": [],
		"outcomes": []
	},
	"general": {
		"events": [
			"The company’s financial department was found to have discrepancies in the accounting details for the annual income statement. The SEC has launched an investigation and has fined the firm heavily.",
			"Speculative Investment into a new cryptocurrency called “PuzzleCoin” has miraculously paid off due to a sharp increase in “hype”. Our department took out the investment at the peak, garnering the maximum amount of profit from the investment.",
			"Through a connection with an Investment Bank named DaVinci, the company has the option of acquiring a smaller firm in the market for fast external growth. This would go against the principles of the company which have focused on building internal culture through controlled growth. Will you change the company’s direction?",
			"After a successful fiscal year, the company has a tremendous surplus from last year’s budget. What shall we do with this money?",
			"Our department found that inflation in our country is currently on the rise. However, the Federal Reserve is planning on increasing the funds rate. Should we invest more or less in the external bonds market? Included is the information from the Federal Reserve Economic Dataset: Federal Funds Rate = 5% and Nominal Inflation = 7%.",
			"There is currently an increasing desire for real estate investment in our country. Our firm is looking to take out some loans to increase our own investment into the economy. Should we follow suit or stay out of the side market and focus on primary business?",
			"Our company is experiencing high demand for our products, which has led to an inflationary gap in the economy. As an investor in the market, should we increase our investments to take advantage of the high prices, or decrease our investments to avoid contributing to the inflationary pressures in the economy?",
			"We are currently investing in a new project that requires a significant upfront investment. There are two potential sources of funding for this project: issuing bonds or issuing stocks. Bonds have a fixed interest rate, but require regular interest payments, while stocks do not have a fixed rate of return and do not require regular payments, but do dilute ownership. Which option should we choose?",
			"Our company has a surplus of cash on hand and is considering investing in short-term securities. However, the Federal Reserve has recently announced that it will be implementing expansionary monetary policy, which is expected to increase the money supply and lower interest rates. Should we still invest in short-term securities or wait for interest rates to go up?",
			"Our company is considering investing in a new project that will require a significant amount of funds. However, a proposed tax reform is currently being debated in Congress that could significantly impact our tax burden. Should we delay the project until the tax reform is resolved or move forward with the investment regardless of the potential tax implications",
			"Recent riots in the cities have left parts of the R&D Department labs unuseable. The company must pay for the damages.",
			"One of the employees in the R&D Department found an innovative new process that increases productivity of workers immensely. The employee was promoted and given a bonus.",
			"In response to the COVID-19 pandemic, the R&D team created an interactive application where employees can work remotely. As pandemic restrictions are being lifted, you are faced with the decision on whether or not to bring employees back into the workplace. Note that employee productivity has been lower since the pandemic started.",
			"The R&D team discovers a defect in a product that is already on the market. It is not a serious concern but could be a health hazard to younger children. This information is confined to the company, but executives are unsure for how long that will be the case. How should we proceed?",
			"Our company is considering investing in a new R&D project that has the potential to revolutionize our industry. However, the upfront costs of the project are significant, and we are unsure if the potential benefits will outweigh the costs. We need to analyze the situation to determine if it makes economic sense to move forward with the project.",
			"Our company is considering investing in a new technology that could significantly increase our productivity. However, the cost of implementing this technology is quite high. We are unsure whether we will be able to sell enough of our products to justify the investment. To assess the feasibility of this investment, we have analyzed the demand and supply for our product in the current market. We found that demand is currently more elastic with the given changes. Based on this information, should we proceed with the investment?",
			"Our company is considering two different projects, Project Alpha and Project Beta. Project Alpha has an expected accounting profit of $50,000 and requires an investment of $100,000. Project Beta has an expected accounting profit of $75,000 and requires an investment of $150,000. However, Project Alpha has a higher economic profit than Project Beta due to lower opportunity costs. The opportunity cost of Project Alpha is $20,000, while the opportunity cost of Project Beta is $30,000. Which project should we choose?",
			"Our company is considering investing in research and development to improve our product line. We have two potential R&D projects: one is focused on improving the quality of our existing products, while the other is focused on developing new products. We have limited resources and can only invest in one of these projects. In addition, these products are in a monopolistic competition market. Which project should we choose?",
			"Our company is considering investing in a new research and development project. The project has a high upfront cost but has the potential to generate significant profits in the future. We have identified two possible research paths: one that is more focused on incremental improvements to our existing products, and another that is more focused on exploring new technologies and potential breakthrough innovations. The incremental path has lower risk, but also lower potential reward, while the breakthrough path has higher risk, but also higher potential reward. Which path should we pursue?",
			"Our company is considering investing in a new research and development project that will require significant upfront costs. One option is to develop the product in-house, while the other is to outsource the R&D to a specialized firm. Outsourcing will require an upfront payment to the firm but will save our company time and resources. On the other hand, in-house development will allow us to maintain control over the entire process but will require more resources and time.",
			"One junior-level manager has been sexually assaulting other employees. The old HR Department Head has looked past the issue multiple times. As a result, the employees went to the public and became a whistleblower to the news. ",
			"Jon Tortilla, our very own manager in HR, has built new hiring connections with his alma mater: Yeung University. The new university connection has vastly improved the future employment lookout for our company.",
			"Our new background check has revealed that your secretary has a criminal record. She has been a valuable employee for many years now and has been crime-free since joining the company. Currently, no one else is aware of this information. How should we proceed?",
			"Shunshick Chowdhary, an HR employee, has suggested changing the company’s onboarding process. Instead of letting the new employee shadow a current employee, they would go through an interactive online demonstration to automate the process. Current employees favor the idea because of the reduced workload. However, studies have shown this may be less effective than the current process. Do we implement the suggestion?",
			"Our company is considering implementing a new policy that would increase wages for all employees. However, we are concerned about the impact this policy would have on the company's profits. Should we implement the new wage policy, or should we maintain our current wage structure?",
			"A division within our firm operates in a small town that is dominated by a single large employer. The employer is known to pay lower wages than what would be expected for the type of work being done. We are concerned that this external monopsony in the labor market is affecting our ability to attract and retain quality employees. Should we increase wages to compete with the dominant employer, or should we try to differentiate ourselves in other ways?",
			"Our company is facing a labor market with a shortage of workers. Currently, our company is paying an average wage that is below the market equilibrium wage rate. Should we raise our wage rate to attract more workers and reduce the labor shortage?",
			"Our company operates in a market with a minimum wage set by the government. The current minimum wage is $10 per hour, which is above the equilibrium wage rate of $8 per hour in a competitive labor market. What should we do about this face?",
			"Our company is considering implementing a new employee benefits program that would cost us $300,000 annually. Our department estimates that this program would lead to an average productivity increase of 10%, resulting in a profit increase of $500,000 annually. However, the Finance Dept. has informed us about the cost and would like to evaluate the marginal benefit and cost of the program.",
			"Your company is experiencing a high turnover rate among employees, which is causing a loss of valuable talent and increased costs associated with recruiting and training new hires. The HR department has suggested implementing a new employee engagement program, which would involve regular team-building activities and career development opportunities. The estimated cost of the program is $100,000 per year, but it is expected to reduce turnover and improve employee productivity.",
			"Your marketing team has decided to shoot its latest commercial on a lake to promote a new product. While filming the commercial, the cameraman dropped the camera in the water after falling overboard while in a kayak!",
			"The social media team has been crowned “Best Social Media Content by a Corporation” by the users. ",
			"Local celebrity, Mr. Johnson, has heavily criticized your company in his latest Tik-Tok. His massive following started boycotting your products! How do we handle the situation?",
			"A charity has approached you on the prospect of a new operation to provide meals for school children in less economically developed areas. However, this charity has been controversial for its ties to anti-LGTBQ organizations. The company could use the PR but does not want to sacrifice its core values. How should we proceed?",
			"Our company is considering expanding our advertising to a new market, but we are concerned about the potential impact of the entire economy going through a transition phase. Right now, unemployment is drastically decreasing in the short run and we are worried about what will happen in the long run. What should we do?",
			"Our market researchers are considering increasing our advertising efforts to increase our market share. However, we are concerned about the potential cost of advertising and whether it will result in higher profits. We know that we are operating in a competitive market, but we historically have some control over price. What should we do?",
			"Our company is considering a new pricing strategy for our product. We are currently in a duopoly market, and we are deciding whether to lower our prices to undercut our only competitor or maintain our current prices. Our marketing analysts have come up with the following estimations for the outcomes of each scenario with our company first listed then the competitor. Values are in millions. What’s the right move?",
			"Our company has introduced a new product in our product line. We are uncertain about the potential future for this product and hence changes in demand are unknown at the moment. However, market data shows that the product has plentiful substitutes. Should we move our price down or maintain the same?",
			"The government has implemented a price ceiling on our product, which is below our current market price. We are currently considering two ways to adapt to this change. Should we increase our advertising or should we advise operations to increase production?",
			"Our company has recently been hit with a new tax on our product, which will increase the cost of production. We are debating whether to increase the price of our product to offset the tax or absorb the cost ourselves. However, we are concerned about the impact on our consumers and reputation. How should we proceed?",
			"One of your main suppliers has gone out of business just before the launch of a new product! Customers complain about the lack of inventory that the company has and go to social media to vent their complaints.",
			"The company pledges to have all of its operations go green by 2035. This was a response from a local recycling enthusiast named Hang who proposed the idea in a company forum.",
			"After one of the employees in the manufacturing plant loses his finger, the other employees go on strike to protest harsh working conditions. This is the first time in company history that a situation like this has occurred. The manufacturing plant has been regarded as one of the best in the nation and has received multiple awards from safety inspection agencies. The strike turned into a riot and resulted in many injuries and property damage. How do we handle this situation before it becomes a PR nightmare?",
			"One of the employees has been using machinery for non-work purposes. The employee has a Youtube channel called MartyOnWheels where he unsafely operates these machines. The company logo is present in all of these videos. What do we do?",
			"Our company has a product operating in a market where we have some control over our pricing and product differentiation. We are considering investing in new equipment to increase production efficiency and lower costs. However, we are unsure of how this investment will impact our pricing strategy and profitability. Can you help us make the best decision for our company?",
			"Our company operates in the manufacturing industry and is experiencing an increase in production costs due to rising raw material prices. We are considering switching to a cheaper supplier but are concerned about the potential impact on quality and customer satisfaction. How should we proceed?",
			"Our company produces two products which we are currently calling X and Y. Due to limited resources, we are faced with a tradeoff between the production of these products. Given our current resources, we are operating at a point that allows us to produce equal amounts of X and Y at maximum productivity. However, we have received a request for a large order of X. Should we accept the order?",
			"Our company operates in a perfectly competitive market and produces a certain product. We are currently producing at a level where our average total cost (ATC) is at its minimum. However, we have noticed that the price of our product in the market is decreasing, and we are unsure whether to continue producing at the same level or decrease our output. We have created a graph that shows the relationship between the quantity of output produced and the market price of our product.",
			"Your company is considering investing in a new production technology that will allow you to produce goods at a lower cost. However, this technology requires a significant upfront investment. Should you invest in this new technology or continue with your current production methods?",
			"A sudden increase in the minimum wage has led to higher labor costs for our company. We are considering two options to maintain our profitability. Should we increase the price of our product or should we decrease our output?"
		],
		"fromevents": [
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"R&D",
			"R&D",
			"R&D",
			"R&D",
			"R&D",
			"R&D",
			"R&D",
			"R&D",
			"R&D",
			"R&D",
			"HR",
			"HR",
			"HR",
			"HR",
			"HR",
			"HR",
			"HR",
			"HR",
			"HR",
			"HR",
			"Marketing",
			"Marketing",
			"Marketing",
			"Marketing",
			"Marketing",
			"Marketing",
			"Marketing",
			"Marketing",
			"Marketing",
			"Marketing",
			"Operations",
			"Operations",
			"Operations",
			"Operations",
			"Operations",
			"Operations",
			"Operations",
			"Operations",
			"Operations",
			"Operations"
		],
		"choices": [
			null,
			null,
			null,
			null,
			null,
			null,
			"Contact DaVinci for the acquisition",
			"Leave the acquisition for another company",
			null,
			"Improve the infrastructure and make repairs to company property.",
			"Give yourself and the executive board a nice pay day!",
			"Increase dividends for shareholders.",
			"Invest more in the markets, knowing that interest rates will go up",
			"Hold onto your money, and wait for the interest rates to go up later",
			null,
			"Take out the loans and invest into the real estate",
			"Stay out of the real-estate market for now",
			null,
			"Increase investments to take advantage of the high prices, knowing that inflationary pressures are driving up prices in the economy",
			"Decrease investments to avoid contributing to the inflationary pressures in the economy, even if it means missing out on potential profits",
			null,
			"Issue bonds to finance the project",
			"Issue stock to finance the project",
			null,
			"Invest in short-term securities now, despite the expected decrease in interest rates, to take advantage of current market conditions",
			"Wait for interest rates to go up before investing in short-term securities, to maximize returns on our investment",
			null,
			"Move forward with the investment regardless of the tax implications",
			"Delay the project until the tax reform is resolved",
			null,
			null,
			null,
			null,
			null,
			null,
			null,
			"Bring back all employees",
			"Bring back no employees.",
			"Bring back essential employees.",
			"Do nothing and wait it out",
			"Recall all the products and fix the issue.",
			"Make a public statement informing customers.",
			"Invest in the R&D project, sacrificing the current production levels.",
			"Continue with our current production levels and forgo the R&D project",
			null,
			"Proceed with the investment",
			"Do not proceed with the investment",
			null,
			"Choose Project A",
			"Choose Project B",
			null,
			"Invest in R&D to improve the quality of existing products",
			"Invest in R&D to develop new products",
			null,
			"Pursue the incremental path",
			"Pursue the breakthrough path",
			null,
			"Develop the product in-house",
			"Outsource the R&D",
			null,
			null,
			null,
			null,
			null,
			null,
			null,
			"Meet with her and discuss the results of the background check.",
			"Fire her and list poor job competency as the reason for the firing.",
			"Use the information as blackmail to force her to take a pay cut.",
			"Yes, approve the suggestion",
			"No, deny the suggestion",
			"Fire Sunshick Chowdhary for job incompetence",
			"Implement the new wage policy, even though it may negatively impact the company's profits",
			"Maintain the current wage structure and avoid the risk of reduced profits",
			null,
			"Increase wages to compete with the dominant employer",
			"Differentiate the company in other ways to attract and retain quality employees",
			null,
			"Raise the wage rate to attract more workers and reduce the labor shortage",
			"Maintain the current wage rate and deal with the labor shortage by reducing production or finding alternative solutions",
			null,
			"Comply with the minimum wage law",
			"Ignore the minimum wage law and pay workers the equilibrium wage rate",
			null,
			"Implement the program since MB > MC.",
			"Do not implement the program since MC > MB.",
			null,
			"Implement the employee engagement program",
			"Do not implement the employee engagement program",
			null,
			null,
			null,
			null,
			null,
			null,
			null,
			"Contact Mr. Johnson and arrange a meeting.",
			"Publicly criticize Mr. Johnson and his viewers.",
			"Pay off Mr. Johnson to stop defaming the company.",
			"Decline the charity’s offer.",
			"Accept the charity’s offer.",
			"Approach a different charity to conduct the new operation.",
			"Invest in expanding to the new market",
			"Wait for the situation to settle before investing",
			null,
			"Increase advertising expenditures to increase market share",
			"Focus on non-price competition instead of advertising",
			null,
			"Maintain our current prices",
			"Lower our prices",
			null,
			"Set the price lower",
			"Increase the price",
			null,
			"Increase advertising to increase demand for the product.",
			"Increase production to try to meet the demand",
			null,
			"Increase the price of our products.",
			"Absorb the cost of the tax ourselves.",
			null,
			null,
			null,
			null,
			null,
			null,
			null,
			"Do nothing and hope the situation fizzles out.",
			"Fire the employees that lead the strike.",
			"Improve safety precautions in the plant even more.",
			"Copystrike the videos and seize future revenue from the channel.",
			"Send the employee to further operational training.",
			"Fire the employee and revoke his operating license.",
			"Invest in new equipment and reduce prices",
			"Do not invest in new equipment and maintain our current pricing strategy",
			null,
			"Switch to a cheaper supplier to reduce production costs, potentially sacrificing quality but maintaining profitability.",
			"Continue with our current supplier and absorb the increased production costs, maintaining quality but potentially decreasing profitability.",
			null,
			"Accept the order for X and produce less of Y",
			"Accept the order for X but maintain our current production of Y",
			"Reject the order for X and maintain our current production",
			"Continue producing at the same level since our ATC is at its minimum and the market price will eventually recover.",
			"Decrease our output to increase the market price of our product and maximize our profits.",
			null,
			"Invest in new technology and increase the capital stock",
			"Continue with current production methods and capital stock",
			null,
			"Increase the price of our product to maintain profit margins.",
			"Decrease our output to reduce our costs.",
			null
		],
		"outcomes": [
			"Shareholders are angry along with the public. Confidence in the firm has decreased sharply and the fines have added up immensely. Tread carefully.",
			"Shareholders are angry along with the public. Confidence in the firm has decreased sharply and the fines have added up immensely. Tread carefully",
			"Shareholders are angry along with the public. Confidence in the firm has decreased sharply and the fines have added up immensely. Tread carefully.",
			"From a situation of wavering certainty, the rise in profits bolstered confidence in the shareholders (perhaps excessively due to a new crowd of investors). However, the general public image of cryptocurrency has fallen after the cash-out leading due to the crypto market crash following.",
			"From a situation of wavering certainty, the rise in profits bolstered confidence in the shareholders (perhaps excessively due to a new crowd of investors). However, the general public image of cryptocurrency has fallen after the cash-out leading due to the crypto market crash following.",
			"From a situation of wavering certainty, the rise in profits bolstered confidence in the shareholders (perhaps excessively due to a new crowd of investors). However, the general public image of cryptocurrency has fallen after the cash-out leading due to the crypto market crash following.",
			"DaVinci successfully closes a deal shortly after your confirmation. The acquisition is financially successful leading to increased profit for the new combined firm. However, some shareholders are angry at the new direction though most have accepted the newfound success. Most of the public goes along with the acquisition with a few exceptions.",
			"The acquisition was called off. Most stakeholders are angry at the loss of opportunity for expansion. The public is impressed by your commitment to values during your press conference, garnering respect for the firm as a whole.",
			null,
			"Employees and executives are thrilled with the new updates and designs to buildings. Morale has increased significantly.",
			"Word gets around and other employees are unhappy with your decision. However, you bought yourself a new jet ski!",
			"Shareholders are thrilled with the extra payments. More people purchase company shares to reap some of these benefits.",
			"The investment was a success with high returns! The result of contractionary policy such as increasing the reserve requirement decreased the money supply and hence increased interest rates. Since the bonds were bought at a lower price, their value grew!",
			"Waiting with the money coming out of the stagflationary period leads to loss of opportunity for future investment. Stockholders are currently unhappy with the decision made as they feel more could’ve been done with the money on hand.",
			null,
			"The loans were of higher interest rates due to the increased general demand for loanable funds. Overcrowding of the real-estate market meant less profits for the investment and was a net negative. Shareholders are disturbed by the poor decision.",
			"By focusing on internal business instead of external real estate, you have focused the company's earnings on reinvestment and have increased profits! Shareholders are happy with the recent success of the firm.",
			null,
			"The company decided to increase its investments to take advantage of the high prices, knowing that inflationary pressures were driving up prices in the economy. This proved to be a wise decision, as the investments yielded high returns due to the market conditions.",
			"The company decided to decrease its investments to avoid contributing to the inflationary pressures in the economy, even if it meant missing out on potential profits. However, this cautious approach caused the company to miss out on potential investment returns and fall behind its competitors who took advantage of the high prices.",
			null,
			"The company issued bonds to finance the project, and was able to secure a favorable interest rate due to the current low interest rate environment depicted in the graph. While the regular interest payments did represent a significant ongoing cost, the fixed interest rate allowed the company to better plan for future cash flows and avoid the potential risks associated with variable interest rates.",
			"The company issued stocks to finance the project, and was able to avoid the regular interest payments associated with bonds. However, the dilution of ownership led to a reduction in the value of existing shares, which resulted in a decrease in stakeholder approval. Additionally, the lack of a fixed rate of return on stocks led to lower profits than would have been achieved with bonds.",
			null,
			"The company decided to invest in short-term securities now, despite the expected decrease in interest rates. This proved to be a smart decision, as the increase in the money supply led to a greater supply of loanable funds, which caused interest rates to decrease less than expected. As a result, the company was able to secure a higher yield on its investments than it would have if it had waited for interest rates to go up.",
			"The company decided to wait for interest rates to go up before investing in short-term securities. However, the increase in the money supply caused interest rates to decrease less than expected, which meant that the company missed out on potential profits by waiting. Additionally, stakeholders may have been unhappy with the company's conservative approach to investing its surplus cash.",
			null,
			"The company decided to move forward with the investment, regardless of the potential tax implications. This proved to be a smart decision, as the investment allowed the company to secure a competitive advantage over its competitors and earn significant profits. Additionally, the tax reform ended up being less severe than originally anticipated, which meant that the company's tax burden was not significantly impacted.",
			"The company decided to delay the project until the tax reform was resolved, to avoid the risk of incurring higher tax costs and potentially losing profits. However, this delay caused the company to miss out on potential profits and fall behind its competitors. Additionally, the tax reform ended up being less severe than originally anticipated, which meant that the delay was unnecessary.",
			null,
			"You pay the damage fees for the R&D Departments to rebuild. Perhaps next time you will purchase some insurance.",
			"You pay the damage fees for the R&D Departments to rebuild. Perhaps next time you will purchase some insurance.",
			"You pay the damage fees for the R&D Departments to rebuild. Perhaps next time you will purchase some insurance.",
			"The company experiences a new period of increased motivation and progress due to the innovation which was recognized. Stockholders as well as the public take notice of the new success.",
			"The company experiences a new period of increased motivation and progress due to the innovation which was recognized. Stockholders as well as the public take notice of the new success.",
			"The company experiences a new period of increased motivation and progress due to the innovation which was recognized. Stockholders as well as the public take notice of the new success.",
			"Employee morale is low and employees are unhappy with returning to the workplace. New buildings had to be rented to support all the returning employees.",
			"Productivity remains low and quotas are not met for the first time in a few years. The board is unhappy with your decision.",
			"Productivity increases and the majority of your employees are happy to continue working at home. The board is happy with your decision.",
			"The public learns about the defect in the product and accuses the company of unethical business practices. The whole situation becomes a big scandal and hurts the company’s stock price heavily. Watergate Part 2?",
			"Customers are extremely happy that the product is being recalled, but executives and shareholders are upset with the large amount of money that needs to be spent on the fixes. Can’t please everyone!",
			"Executives and shareholders are happy that the company is not spending a large sum of money to fix the issue, but customers are extremely unhappy that the company is not doing a recall. Can’t please everyone!",
			"The company decided to invest heavily in R&D and was able to create a new product that was a hit with consumers. This product soared the capacity and position of the firm to new heights, placing it in leagues with other major firms in the market!",
			"The company decided not to invest in R&D and instead focused on cutting costs to maintain profitability. However, this led to a decrease in product quality and a loss of market share.",
			null,
			"The company proceeded with the investment in the new technology, resulting in a rightward shift of the supply curve. This led to an increase in the quantity supplied and a potential increase in the equilibrium price and quantity. However, it is important to note that the success of the investment depends on the price elasticity of demand for our product, as a highly elastic demand curve may not result in a significant increase in price and quantity.",
			"The company decided not to invest in the new technology, resulting in no shift in the supply curve. This led to a potential decrease in the equilibrium quantity and price. However, by avoiding the significant investment cost, the company was able to maintain its current financial position and potentially invest in other opportunities in the future.",
			null,
			"The company chooses Project A and invests $100,000 in the project. While the accounting profit of $50,000 is lower than that of Project B, the economic profit of $30,000 (accounting profit - opportunity cost) is higher than that of Project B ($45,000). The lower opportunity cost of Project A allows the company to generate a higher economic profit despite the lower accounting profit.",
			"The company chooses Project B and invests $150,000 in the project. While the accounting profit of $75,000 is higher than that of Project A, the economic profit of $45,000 (accounting profit - opportunity cost) is lower than that of Project A ($30,000). The higher opportunity cost of Project B reduces the economic profit and makes it a worse option despite the higher accounting profit.",
			null,
			"The company invested in R&D to improve the quality of existing products. While this led to higher-quality products, it did not result in a significant increase in market share or profitability. This is already a high degree of competition, with multiple firms producing similar products. As a result, the marginal benefit of improving product quality was relatively small compared to the cost of R&D investment.",
			"The company invested in R&D to develop new products. This led to the creation of innovative products that differentiated the company from its competitors, resulting in increased market share and profitability. The market has less competition, with fewer firms producing similar products. As a result, the marginal benefit of developing new products was relatively high compared to the cost of R&D investment.",
			null,
			"The company pursued the incremental path and was able to make steady improvements to its existing products, resulting in increased sales and revenue. However, the more conservative approach led to missed opportunities for significant breakthroughs and technological advancements, limiting the company's long-term potential for growth.",
			"The company pursued the breakthrough path and invested heavily in researching new technologies and potential breakthrough innovations. While some of the investments did not result in successful products or revenue, the company was able to make significant breakthroughs that positioned them as a leader in their industry. The higher-risk approach paid off in the long term but came at the expense of short-term profits.",
			null,
			"The company decided to develop the product in-house. While this allowed the company to maintain control over the entire process and potentially lead to better outcomes, the higher marginal cost led to increased costs for the company. In addition, the company had to allocate more resources and time to the project, potentially delaying its launch to the market.",
			"The company decided to outsource the R&D to a specialized firm. This decision saved the company resources and time, allowing for a faster launch of the product to the market. However, the upfront payment required for outsourcing led to higher upfront costs for the company.",
			null,
			"The reputation of the company takes a hit and some shareholders are angry about the news. The Junior Level Manager has been promptly fired, but the damage has been done.",
			"The reputation of the company takes a hit and some shareholders are angry about the news. The Junior Level Manager has been promptly fired, but the damage has been done.",
			"The reputation of the company takes a hit and some shareholders are angry about the news. The Junior Level Manager has been promptly fired, but the damage has been done.",
			"Future employment opportunities with talented grads excite the stockholders as well as increase public perception of the firm through job fairs at Yeung University.",
			"Future employment opportunities with talented grads excite the stockholders as well as increase public perception of the firm through job fairs at Yeung University.",
			"Future employment opportunities with talented grads excite the stockholders as well as increase public perception of the firm through job fairs at Yeung University.",
			"After discussing the background check, the secretary and you agree on a severance package. The news is kept private and has no impact on greater business due to the professional dealing.",
			"After the firing, the secretary starts to bad-mouth the company for unjust dismissal. The knowledge of the secretary’s criminal records also comes to light, but still, some damage was done.",
			"You move the cut portion of your secretary’s salary to your bonus for the year. The secretary is unable to do anything and continues working her job. You got a nice payday. Unethical!",
			"Employees are happy with the new process, and new employees do not seem to have trouble assimilating with the company. Go Shunshick!",
			"Employees are annoyed by the additional workload, but the new employees feel very prepared with the old process. If it ain’t broke don’t fix it!",
			"Shunshick publicly criticizes the company for unfair dismissal. The company takes heat from the public and current employees become more hesitant to share their ideas. Maybe this wasn’t the best idea!",
			"The company implemented the new wage policy, which led to increased employee satisfaction and reduced turnover rates. The increased wages also attracted new employees, leading to a larger pool of qualified candidates to choose from. Although the initial cost of the wage increase negatively impacted profits, the long-term benefits of reduced turnover and increased productivity resulted in a net gain.",
			"The company decided to maintain the current wage structure to avoid the risk of reduced profits. However, this approach led to decreased employee satisfaction and increased turnover rates, resulting in higher costs associated with hiring and training new employees. Additionally, the company's reputation suffered as employees felt undervalued and underpaid.",
			null,
			"The company increased wages to compete with the dominant employer, which led to increased employee satisfaction and reduced turnover rates. The increased wages also attracted new employees, leading to a larger pool of qualified candidates to choose from. Although the initial cost of the wage increase negatively impacted profits, the long-term benefits of reduced turnover and increased productivity resulted in a net gain.",
			"The company decided to differentiate itself in other ways to attract and retain quality employees. This included offering more flexible working hours, better benefits, and opportunities for career growth. Although this approach did help attract and retain some quality employees, it was not enough to fully counteract the impact of the external monopsony on the labor market. As a result, the company struggled to attract and retain the best employees, which negatively impacted productivity and profits.",
			null,
			"The company decided to raise the wage rate to attract more workers and reduce the labor shortage. This led to an increase in the quantity of labor supplied, which allowed the company to increase production and profits. Although the increase in wage rate negatively impacted profits in the short term, the long-term benefits of increased production and growth resulted in a net gain.",
			"The company decided to maintain the current wage rate and deal with the labor shortage by reducing production or finding alternative solutions. This approach helped the company to control costs in the short term, but it also limited the company's ability to grow and expand. In addition, the labor shortage created problems for the company's existing employees, who had to work longer hours and take on additional responsibilities.",
			null,
			"By complying with the minimum wage law, the company faces higher labor costs, which leads to a decrease in profit margin. However, the company can attract more qualified workers with a higher wage rate, which can lead to increased productivity and better quality output. In addition, the company may benefit from an improved public image by being socially responsible.",
			"By ignoring the minimum wage law, the company can maintain lower labor costs, which leads to a higher profit margin. However, the company may struggle to attract and retain qualified workers who can earn higher wages elsewhere. Additionally, the company may face legal consequences for violating labor laws, which can lead to penalties, fines, or even loss of business license.",
			null,
			"The implementation was successful and increased productivity as expected. The program led to a significant profit increase, with the marginal benefit exceeding the marginal cost. The decision was positively received by stakeholders and the company's reputation was enhanced.",
			"The decision to not implement the program was met with disappointment from employees and shareholders. However, the company was able to save on increased costs but it is unknown whether this was worth it. The company's reputation remained neutral as this was an internal issue.",
			null,
			"The implementation of the employee engagement program was a success. Employee turnover has decreased, and employee productivity has increased. The program has helped to build a stronger sense of community among employees and improve job satisfaction. The cost of the program has been offset by the savings associated with reduced turnover.",
			"Without the employee engagement program, the high turnover rate continues to negatively impact the company's bottom line. The cost of recruiting and training new hires continues to increase, and productivity is lower due to the loss of experienced employees.",
			null,
			"The marketing team is unable to finish the commercial and needs more money than allotted in the marketing budget. The new product does badly in its first week. Next time, get a double kayak!",
			null,
			null,
			"The company gets positive media attention, and more people in our target market are aware of our products. Way to go team!",
			null,
			null,
			"The company’s social media tries to contact Mr. Johnson to defuse the situation, but he refuses to meet with us. Tough luck!",
			"Mr. Johnson retaliates with a diss track on the company that goes viral. No bad publicity right?",
			"Mr. Johnson takes the big sum of money we threw at him. He starts promoting the company to his viewers. Money talks!",
			"The news gets leaked to the public, which assumes the company declined to help the children because of corporate greed. Loyal families stop purchasing from the company. Oh boy!",
			"The new operation brings in some good PR for the company, but the company is also heavily criticized for its association with the charity. Many loyal customers stop purchasing from the company and the stock price drops. To add insult to injury, the charity has been revealed to be a front for money laundering. Ouch!",
			"The new operation is a success, and the company receives a lot of good PR. The controversial charity has been revealed to be a front for money laundering. Bullet dodged!",
			"The investment paid off, despite a slight increase in the inflation rate. Unemployment remained relatively stable compared to inflation in the long run. Our company's profits increased without impact from economic disaster.",
			"Waiting for the inflation rate to decrease resulted in missed opportunities and potential loss of market share. Our competitors who acted more quickly were able to capture a larger portion of the market.",
			null,
			"The increase in advertising expenditures paid off, resulting in a significant increase in revenue and market share. Our company's profits also increased, though the cost of advertising did cut into some of the gains.",
			"Maintaining current advertising expenditures resulted in slower growth and limited market share gains. While profits were stable, our company may have missed out on potential growth opportunities.",
			null,
			"Maintaining our current prices resulted in a slight decrease in profits due to the competitor cutting prices. However, this is far from the worst option. ",
			"Lowering our prices resulted in a decrease in profits due to a simultaneous decision by the competition to decrease. Shareholders are angry that the price war has mainly negatively impacted our company due to a lack of brand loyalty. Next time, don’t disturb the market leader!",
			null,
			"Setting the price lower undercuts the competition allowing our firm to increase sales! In the short run, this strategy worked but now the public views the product as more of an “economy” cheap product. ",
			"Increasing the price in a market with many substitutes led to a sharp decrease in sales. We lost our competitive advantage and the public now views the product as a “cowboy” brand of low quality but high price. ",
			null,
			"Increasing advertising led to a slight increase in demand, but the price ceiling still resulted in a shortage of the product and worsened the problem. This led to frustration among consumers who were unable to purchase the product and a decrease in overall sales volume.",
			"Increasing production led to a temporary increase in supply, but the price ceiling still resulted in a shortage of the product. The company was able to maintain sales volume, but at a lower price point, resulting in lower profit margins.",
			null,
			"Increasing the price of our product led to a decrease in demand, as consumers were less willing to pay the higher price. This resulted in a decrease in overall sales volume, but the company was able to maintain its profit margin.",
			"Absorbing the cost of the tax ourselves led to a decrease in profit margin, but the company was able to maintain its sales volume and avoid any negative impact on its reputation.",
			null,
			"The launch of your new product does not go well. Scalpers use bots to purchase from the limited stock on the website and upscale the price to the general public. Customers are very unhappy with the whole situation. Wrong place, wrong time!",
			null,
			null,
			"With the issue of global warming growing each year, the public is happy that such a large corporation has taken a step toward tackling the issue. ",
			null,
			null,
			"The company ends up paying for the damages to the plant, but overall nothing happens. Tensions calm down and things go back to normal. Keep calm and carry on!",
			"The employees leading the strike were let go. Other employees reported that these employees had been conspiring against the company for weeks. Talk about bad apples!",
			"The company improves infrastructure and machinery to be even safer. A large initial investment and frequent repairs are needed. Total quality management pays off right?",
			"The copy-strike goes through the algorithm and the channel gets successfully demonetized by the company. You are now the owner of MartyOnWheels. However, the public is a little ticked off. UMG has nothing on us!",
			"The employee agrees to go to additional operational training. During the training, he was filming an apology video and fell out of a crane. The company insurance paid for his medical expenses, but he was promptly let go after the incident. In the hospital, he created another youtube channel called MartyOnWheelchair, where he filmed himself fooling around with hospital equipment. The show must go on!",
			"The employee is furious and plans to raid the facility before his keycard expires. He live-streams on Youtube so the viewers can see. He destroys some boxes and starts nibbling on packing peanuts. Eventually, he goes too far and knocks over a pile of boxes, which fall on him and render him unconscious. Security escorts him outside the building, where he is greeted with cheers from fans. It is later understood that the public assumed it was a PR stunt.",
			"Investing in new equipment led to a shift downward in the short-run and long-run average cost curves, resulting in a lower cost per unit produced. This allowed the company to reduce prices while maintaining its profit margin, increasing market share.",
			"Not investing in new equipment led to no change in the short-run and long-run average cost curves, resulting in no change in cost per unit produced. However, maintaining the current pricing strategy resulted in a decrease in market share due to increased competition from more efficient firms.",
			null,
			"Switching to a cheaper supplier led to a decrease in product quality and a decrease in customer satisfaction. However, the company was able to maintain profitability levels due to the reduction in production costs.",
			"Absorbing the increased production costs led to a decrease in profitability levels, but the company was able to maintain its product quality and customer satisfaction.",
			null,
			"Accepting the order for X and producing less Y results in an increase in production efficiency and a boost in profits. However, there may be some impact on our customer base as the supply of Y may be lower than before.",
			"Accepting the order for X and maintaining our current production of Y proved to be impossible for our facilities without further investment. We failed to create all orders of X promised, making all parties involved angry.",
			"Rejecting the order for X and maintaining our current production of both X and Y may lead to a loss of potential profits. However, the production process remains stable and the supply of both products remains the same, which slightly positively impacts customer satisfaction.",
			"Since we continue producing at the same level, our quantity supplied remains constant. Due to the decrease in market price, our revenue decreases as well. However, since our ATC is at its minimum, we are still able to make a profit, albeit a smaller one.",
			"By decreasing our output, the market price of our product increases due to the decrease in supply. This results in higher revenue for each unit of output sold. However, since we are producing less, our total revenue and profit decrease.",
			null,
			"By investing in new technology, our company was able to produce goods at a lower cost, which increases profits. The increase in profits allows the company to expand operations and hire more workers, leading to an increase in output and an increase in our production possibilities.",
			"By maintaining the current production methods, your company may not be able to compete with other firms that have adopted the new technology, leading to a decline in market share and profits. As a result, the company may not be able to expand operations or hire as many workers, leading to a decrease in output and production possibilities.",
			null,
			"Increasing the price of the product led to a shift along the demand curve, resulting in a decrease in revenue. Some customers were not willing to pay the higher price, and the company lost market share to competitors. The company's reputation also suffered due to negative feedback from customers.",
			"Decreasing the output led to a decrease in supply, which led to an increase in the price of the product. However, the decrease in sales volume due to the higher price resulted in lower revenue. The company's reputation also suffered due to negative feedback from customers who were unable to purchase the product.",
			null
		],
		"graphs": [
			0, 0, 0, 0, 15, 14, 13, 0, 15, 14, 0, 0, 0, 0, 2, 1, 0, 9, 0, 7, 0, 0, 0, 0, 10, 12, 10, 3, 1, 0, 0, 0, 0, 0, 16, 9, 0, 1, 4, 5, 0, 0, 0, 0, 12, 1, 2, 8, 2, 1
		],
		"profiteffects": [
			-0.2, -0.2, -0.2, 0.05, 0.05, 0.05, 0.25, 0, 0, 0, 0, 0.04, 0.05, 0, 0, -0.05, 0.1, 0, 0.1, 0, 0, 0.06, 0.03, 0, 0.04, 0, 0, 0.08, 0, 0, -0.1, -0.1, -0.1, 0.15, 0.15, 0.15, -0.03, -0.03, 0.03, -0.07, -0.05, 0.00, 0.15, -0.1, 0, 0.1, -0.05, 0, 0.15, -0.1, 0, -0.05, 0.1, 0, 0.02, -0.07, 0, -0.1, 0.05, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.02, 0, 0, -0.05, 0, 0, -0.05, 0, 0, -0.1, 0, 0, -0.05, 0.1, 0, 0.15, 0, 0, 0.05, -0.05, 0, -0.02, -0.02, -0.02, 0.03, 0.03, 0.03, -0.01, 0, -0.01, -0.01, -0.03, 0, 0.07, -0.05, 0, 0.05, 0, 0, -0.08, -0.15, 0, 0.05, -0.1, 0, -0.01, -0.04, 0, 0.02, -0.02, 0, -0.03, -0.03, -0.03, 0, 0, 0, -0.01, 0, 0.03, 0.01, -0.01, 0, 0.05, 0, 0, 0.05, -0.05, 0, 0.05, -0.05, 0, 0.05, -0.02, 0, 0.05, -0.05, 0, -0.02, -0.04, 0
		],
		"stakeholdereffects": [
			-0.4, -0.4, -0.4, 0.25, 0.25, 0.25, -0.02, -0.1, 0, 0.15, -0.2, 0.05, 0.1, -0.05, 0, -0.15, 0.1, 0, 0.05, -0.05, 0, 0.15, -0.1, 0, 0.08, -0.05, 0, 0.1, -0.05, 0, -0.05, -0.05, -0.05, 0.2, 0.2, 0.2, -0.03, -0.05, 0.05, 0, -0.03, 0.05, 0.15, -0.1, 0, 0.05, 0, 0, 0.05, -0.05, 0, 0.05, 0.1, 0, 0.05, 0.1, 0, 0.05, -0.05, 0, -0.02, -0.02, -0.02, 0.08, 0.08, 0.08, 0, -0.01, 0, 0.02, 0.01, -0.03, 0.1, -0.05, 0, 0.1, -0.05, 0, 0.1, -0.05, 0, 0.1, -0.1, 0, 0.1, -0.05, 0, 0.1, -0.1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -0.05, 0, 0.1, -0.1, 0, 0.1, -0.05, 0, -0.03, -0.1, 0, 0.05, -0.05, 0, -0.03, 0.03, 0, -0.01, 0.01, 0, 0, 0, 0, 0, 0, 0, 0.01, 0.02, 0.01, 0, 0, 0, 0.1, -0.05, 0, -0.1, 0.1, 0, 0.01, -0.05, -0.05, 0, 0, 0, 0.05, -0.05, 0, -0.05, -0.06, 0
		],
		"publicimgeffects": [
			-0.4, -0.4, -0.4, -0.05, -0.05, -0.05, -0.02, 0.15, 0, 0, 0, 0.02, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.05, -0.05, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.01, 0.01, 0.01, 0, 0, 0, -0.05, 0.07, -0.03, 0.1, -0.15, 0, 0.05, 0, 0, 0, 0, 0, 0, 0.05, 0, 0.01, 0.08, 0, -0.05, 0.05, 0, -0.04, -0.04, -0.04, 0.02, 0.02, 0.02, 0, -0.05, 0, 0, 0, -0.03, 0.05, -0.1, 0, 0.05, -0.1, 0, 0, -0.05, 0, 0.05, -0.2, 0, 0.05, 0, 0, 0.1, -0.1, 0, 0, 0, 0, 0.03, 0.03, 0.03, -0.02, -0.05, 0.02, -0.02, -0.1, 0.04, 0, -0.05, 0, 0, 0, 0, 0, -0.05, 0, -0.02, -0.1, 0, -0.08, 0.01, 0, -0.01, 0.02, 0, -0.03, -0.03, -0.03, 0.04, 0.04, 0.04, 0, 0, 0, -0.02, 0, 0.02, 0, 0, 0, -0.05, 0.05, 0, -0.01, -0.05, 0.01, 0, 0, 0, 0.05, -0.02, 0, -0.08, -0.05, 0
		]
	}
}