{
	"name": "MrCeo",
	"companyTypes": ["tech, fast_food", "fashion", "car_company", "retail", "entertainment"],
	"tech": {
		"events": [
			"You have been doing trade for one year in the neighboring country. You have now realized $2,000,000 in net imports from this country. What should you do with the money accumulated from this trade?",
			"Currently interest rates are up in the bonds market. Luckily your finance department has been holding bonds worth $200,000 in the current market, available to sell. A set of financial projections has also been provided for your viewing. Will you sell the bonds?",
			"A new development has been made in your R&D Department allowing for a reduction in cost by $150 by using a new material in the computer chip. However, it was found that there are slight risks of catching a flame under high workload. Do you use the new chip?",
			"Your competitor Comp4U is going out of business. The company has been under fire for having cheap quality . Their owner has approached you about purchasing Comp4U and their hardware and software patents. Do you buy Comp4U?",
			"Your company is under fire for importing parts from a country that uses child labor. The general public is attacking the company for supporting unethical business practices and is losing revenue. Do you change manufacturers?",
			"The new logo used for one of your new services has been copyright striked. The logo is slightly different but strongly resembles the other company’s logo. This was done accidentally but the other company is now suing for copyright infringement.",
			"Some of your customers have been running into a basic bug interfering with their usage of the company’s A-23 computers. The R&D department has found a solution, but there will need to be a 2 week recall. The issue is not major and does not affect performance for everyone, but could worsen. Do you recall the computers?"
		],
		"fromevents": [
			"HQ",
			"Finance",
			"HR",
			"HQ",
			"HQ",
			"Marketing",
			"Operations"
		],
		"choices": [
			"Take the money and use it to get back your home currency in the FOREX",
			"Reinvest in the other country, increasing investments",
			"Hold it for now, choosing what to do later.",
			"Yes: Sell the Bonds at the current market price.",
			"No: Hold the Bonds for possible future use or collateral.",
			"Wait for Sale: Wait for the markets to change over time, possibly for a drop in interest rates and increase in Bond Price.",
			"Yes: Starts the use of the new chip, possibly taking a damage to reputation",
			"No: Opt out of the lower cost but definitely keep reputation",
			"Wait: Use more resources to solve the problem, which would bite down on profits for now",
			"Yes: Buy Comp4U and rebrand, gaining a new asset, profits may temporarily decrease and stay low",
			"No: Stakeholders may get upset",
			null,
			"Yes: Change the company’s primary manufacturer and release an apology to the public, profits may fall",
			"No: Keep the same manufacturer and let crisis management do its thing",
			null,
			null,
			null,
			null,
			"Yes: Recall the computers, profit probably goes down, and public rating may go up or down",
			"No: Nothing may happen, but public rating may decrease",
			null
		],
		"outcomes": [
			"The results of changing back to currency might decrease or increase profit and stakeholder but will increase reputation.",
			"Reinvestment will increase profit and stakeholder but decrease reputation.",
			"Will not change factors until chosen to move into 1 or 2. If nothing is chosen by the end of the year, your currency has a chance of being lost in the big global recession at the end of year 1.",
			"Interest rates fall after selling, meaning profit is maximized. Increased Profit and Stakeholder Approval",
			"Decreased interest rates after selling, meaning more profit could’ve been made. Still increase profit and stakeholder approval, but less than 1.",
			"No change was made to any indicators since it was not sold.",
			"You use the chip and nothing happens",
			"You use the chip and it catches fire in several computers. Your societal approval rating, profit, and stakeholder levels drop",
			"You do nothing and stakeholder decreases slightly",
			"Comp4U’s products and parts are incompatible with your current products, making the benefits of the purchase minimal, profit ratings drop significantly",
			"Your R&D team is able to incorporate Comp4U’s services into your product mix. Your profit ratings increase significantly, your stakeholder rating go up",
			null,
			"The company’s profit goes down because of new manufacturer, but the public approval rating has gone up",
			"Public approval rating drops significantly",
			null,
			"You win the court case, no bars change",
			"You lose the court case, profit drops and public approval drop",
			null,
			"You recall the computers, profit goes down, stakeholder and public approval rating goes down",
			"You recall the computers, profit and stakeholder goes down, but public approval rating goes up",
			"The bug is not major so no bar changes"
		],
		"graphs": [
			2, 3, 13, 5, 7, 8, 5, 15, 11, 9, 8, 1, 13, 4, 12, 13, 4, 16, 7, 8
		],
		"profiteffects": [
			1, -1, 0, -1, -1, 0, 1, 0, 0.5, -1, 0.4, 0.4, -0.4, -0.5, 0.5, 0.5, 1, -1, 0, 0, 0
		],
		"publicimgeffects": [
			0, -1, 0, -1, -1, 0, 1, 0, 0.5, -1, 0.4, 0.4, -0.4, -0.5, 0.5, 0.5, 1, -1, 0, 0, 0
		],
		"stakeholdereffects": [
			1, -1, 0.5, 0, -1, 0, -1, -1, 0, 1, 0, 0.5, -1, 0.4, 0.4, -0.4, -0.5, 0.5, 0.5, 1, 0
		]

	},
	"fast_food": {
		"events": [
			"A new development",
			"Hi baby"
		],
		"fromevents": [],
		"choices": [],
		"outcomes": []
	},
	"general": {
		"events": [
			"The company’s financial department was found to have discrepancies in the accounting details for the annual income statement. The SEC has launched an investigation and has fined the firm heavily.",
			"Speculative Investment into a new cryptocurrency called “PuzzleCoin” has miraculously paid off due to a sharp increase in “hype”. Our department took out the investment at the peak, garnering the maximum amount of profit from the investment.",
			"Through a connection with an Investment Bank named DaVinci, the company has the option of acquiring a smaller firm in the market for fast external growth. This would go against the principles of the company which have focused on building internal culture through controlled growth. Will you change the company’s direction?",
			"After a successful fiscal year, the company has a tremendous surplus from last year’s budget. What shall we do with this money?",
			"Our department found that inflation in our country is currently on the rise. However, the Federal Reserve is planning on increasing the funds rate. Should we invest more or less in the external bonds market? Included is the information from the Federal Reserve Economic Dataset: Federal Funds Rate = 5% and Nominal Inflation = 7%.",
			"There is currently an increasing desire for real estate investment in our country. Our firm is looking to take out some loans to increase our own investment into the economy. Should we follow suit or stay out of the side market and focus on primary business?",
			"Our company is experiencing high demand for our products, which has led to an inflationary gap in the economy. As an investor in the market, should we increase our investments to take advantage of the high prices, or decrease our investments to avoid contributing to the inflationary pressures in the economy?",
			"We are currently investing in a new project that requires a significant upfront investment. There are two potential sources of funding for this project: issuing bonds or issuing stocks. Bonds have a fixed interest rate, but require regular interest payments, while stocks do not have a fixed rate of return and do not require regular payments, but do dilute ownership. Which option should we choose?",
			"Our company has a surplus of cash on hand and is considering investing in short-term securities. However, the Federal Reserve has recently announced that it will be implementing expansionary monetary policy, which is expected to increase the money supply and lower interest rates. Should we still invest in short-term securities or wait for interest rates to go up?",
			"Our company is considering investing in a new project that will require a significant amount of funds. However, a proposed tax reform is currently being debated in Congress that could significantly impact our tax burden. Should we delay the project until the tax reform is resolved or move forward with the investment regardless of the potential tax implications",
			"Recent riots in the cities have left parts of the R&D Department labs unuseable. The company must pay for the damages.",
			"One of the employees in the R&D Department found an innovative new process that increases productivity of workers immensely. The employee was promoted and given a bonus.",
			"In response to the COVID-19 pandemic, the R&D team created an interactive application where employees can work remotely. As pandemic restrictions are being lifted, you are faced with the decision on whether or not to bring employees back into the workplace. Note that employee productivity has been lower since the pandemic started.",
			"The Director of R&D has recently died in a car accident. Before his death, he posted a string of tweets on Twitter heavily criticizing the company. As a result, the public has been speculating that the company was responsible for his death, but the company had nothing to do with it. What does the company do?",
			"Our company is considering investing in a new R&D project that has the potential to revolutionize our industry. However, the upfront costs of the project are significant, and we are unsure if the potential benefits will outweigh the costs. We need to analyze the situation to determine if it makes economic sense to move forward with the project.",
			"Prompt: Our company is considering investing in a new technology that could significantly increase our productivity. However, the cost of implementing this technology is quite high. We are unsure whether we will be able to sell enough of our products to justify the investment. To assess the feasibility of this investment, we have analyzed the demand and supply for our product in the current market. We found that demand is currently more elastic with the given changes. Based on this information, should we proceed with the investment?",
			"Our company is considering two different projects, Project Alpha and Project Beta. Project Alpha has an expected accounting profit of $50,000 and requires an investment of $100,000. Project Beta has an expected accounting profit of $75,000 and requires an investment of $150,000. However, Project Alpha has a higher economic profit than Project Beta due to lower opportunity costs. The opportunity cost of Project Alpha is $20,000, while the opportunity cost of Project Beta is $30,000. Which project should we choose?",
			"Our company is considering investing in research and development to improve our product line. We have two potential R&D projects: one is focused on improving the quality of our existing products, while the other is focused on developing new products. We have limited resources and can only invest in one of these projects. In addition, these products are in a monopolistic competition market. Which project should we choose?",
			"Our company is considering investing in a new research and development project. The project has a high upfront cost, but has the potential to generate significant profits in the future. We have identified two possible research paths: one that is more focused on incremental improvements to our existing products, and another that is more focused on exploring new technologies and potential breakthrough innovations. The incremental path has lower risk, but also lower potential reward, while the breakthrough path has higher risk, but also higher potential reward. Which path should we pursue?",
			"Our company is considering investing in a new research and development project that will require significant upfront costs. One option is to develop the product in-house, while the other is to outsource the R&D to a specialized firm. Outsourcing will require an upfront payment to the firm but will save our company time and resources. On the other hand, in-house development will allow us to maintain control over the entire process but will require more resources and time."
		],
		"fromevents": [
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"Finance",
			"R&D",
			"R&D",
			"R&D"
		],
		"choices": [
			null,
			null,
			null,
			null,
			null,
			null,
			"Contact DaVinci for the acquisition",
			"Leave the acquisition for another company",
			null,
			"Improve the infrastructure and make repairs to company property.",
			"Give yourself and the executive board a nice pay day!",
			"Increase dividends for shareholders.",
			"Invest more in the markets, knowing that interest rates will go up",
			"Hold onto your money, and wait for the interest rates to go up later",
			null,
			"Take out the loans and invest into the real estate",
			"Stay out of the real-estate market for now",
			null,
			"Increase investments to take advantage of the high prices, knowing that inflationary pressures are driving up prices in the economy",
			"Decrease investments to avoid contributing to the inflationary pressures in the economy, even if it means missing out on potential profits",
			null,
			"Issue bonds to finance the project",
			"Issue stock to finance the project",
			null,
			"Invest in short-term securities now, despite the expected decrease in interest rates, to take advantage of current market conditions",
			"Wait for interest rates to go up before investing in short-term securities, to maximize returns on our investment",
			null,
			"Move forward with the investment regardless of the tax implications",
			"Delay the project until the tax reform is resolved",
			null,
			null,
			null,
			null,
			null,
			null,
			null,
			"Bring back all employees",
			"Bring back no employees.",
			"Bring back essential employees."
		],
		"outcomes": [
			"Shareholders are angry along with the public. Confidence in the firm has decreased sharply and the fines have added up immensely. Tread carefully.",
			"Shareholders are angry along with the public. Confidence in the firm has decreased sharply and the fines have added up immensely. Tread carefully",
			"Shareholders are angry along with the public. Confidence in the firm has decreased sharply and the fines have added up immensely. Tread carefully.",
			"From a situation of wavering certainty, the rise in profits bolstered confidence in the shareholders (perhaps excessively due to a new crowd of investors). However, the general public image of cryptocurrency has fallen after the cash-out leading due to the crypto market crash following.",
			"From a situation of wavering certainty, the rise in profits bolstered confidence in the shareholders (perhaps excessively due to a new crowd of investors). However, the general public image of cryptocurrency has fallen after the cash-out leading due to the crypto market crash following.",
			"From a situation of wavering certainty, the rise in profits bolstered confidence in the shareholders (perhaps excessively due to a new crowd of investors). However, the general public image of cryptocurrency has fallen after the cash-out leading due to the crypto market crash following.",
			"DaVinci successfully closes a deal shortly after your confirmation. The acquisition is financially successful leading to increased profit for the new combined firm. However, some shareholders are angry at the new direction though most have accepted the newfound success. Most of the public goes along with the acquisition with a few exceptions.",
			"The acquisition was called off. Most stakeholders are angry at the loss of opportunity for expansion. The public is impressed by your commitment to values during your press conference, garnering respect for the firm as a whole.",
			null,
			"Employees and executives are thrilled with the new updates and designs to buildings. Morale has increased significantly.",
			"Word gets around and other employees are unhappy with your decision. However, you bought yourself a new jet ski!",
			"Shareholders are thrilled with the extra payments. More people purchase company shares to reap some of these benefits.",
			"The investment was a success with high returns! The result of contractionary policy such as increasing the reserve requirement decreased the money supply and hence increased interest rates. Since the bonds were bought at a lower price, their value grew!",
			"Waiting with the money coming out of the stagflationary period leads to loss of opportunity for future investment. Stockholders are currently unhappy with the decision made as they feel more could’ve been done with the money on hand.",
			null,
			"The loans were of higher interest rates due to the increased general demand for loanable funds. Overcrowding of the real-estate market meant less profits for the investment and was a net negative. Shareholders are disturbed by the poor decision.",
			"By focusing on internal business instead of external real estate, you have focused the company's earnings on reinvestment and have increased profits! Shareholders are happy with the recent success of the firm.",
			null,
			"The company decided to increase its investments to take advantage of the high prices, knowing that inflationary pressures were driving up prices in the economy. This proved to be a wise decision, as the investments yielded high returns due to the market conditions.",
			"The company decided to decrease its investments to avoid contributing to the inflationary pressures in the economy, even if it meant missing out on potential profits. However, this cautious approach caused the company to miss out on potential investment returns and fall behind its competitors who took advantage of the high prices.",
			null,
			"The company issued bonds to finance the project, and was able to secure a favorable interest rate due to the current low interest rate environment depicted in the graph. While the regular interest payments did represent a significant ongoing cost, the fixed interest rate allowed the company to better plan for future cash flows and avoid the potential risks associated with variable interest rates.",
			"The company issued stocks to finance the project, and was able to avoid the regular interest payments associated with bonds. However, the dilution of ownership led to a reduction in the value of existing shares, which resulted in a decrease in stakeholder approval. Additionally, the lack of a fixed rate of return on stocks led to lower profits than would have been achieved with bonds.",
			null,
			"The company decided to invest in short-term securities now, despite the expected decrease in interest rates. This proved to be a smart decision, as the increase in the money supply led to a greater supply of loanable funds, which caused interest rates to decrease less than expected. As a result, the company was able to secure a higher yield on its investments than it would have if it had waited for interest rates to go up.",
			"The company decided to wait for interest rates to go up before investing in short-term securities. However, the increase in the money supply caused interest rates to decrease less than expected, which meant that the company missed out on potential profits by waiting. Additionally, stakeholders may have been unhappy with the company's conservative approach to investing its surplus cash.",
			null,
			"The company decided to move forward with the investment, regardless of the potential tax implications. This proved to be a smart decision, as the investment allowed the company to secure a competitive advantage over its competitors and earn significant profits. Additionally, the tax reform ended up being less severe than originally anticipated, which meant that the company's tax burden was not significantly impacted.",
			"The company decided to delay the project until the tax reform was resolved, to avoid the risk of incurring higher tax costs and potentially losing profits. However, this delay caused the company to miss out on potential profits and fall behind its competitors. Additionally, the tax reform ended up being less severe than originally anticipated, which meant that the delay was unnecessary.",
			null,
			"You pay the damage fees for the R&D Departments to rebuild. Perhaps next time you will purchase some insurance.",
			"You pay the damage fees for the R&D Departments to rebuild. Perhaps next time you will purchase some insurance.",
			"You pay the damage fees for the R&D Departments to rebuild. Perhaps next time you will purchase some insurance.",
			"The company experiences a new period of increased motivation and progress due to the innovation which was recognized. Stockholders as well as the public take notice of the new success.",
			"The company experiences a new period of increased motivation and progress due to the innovation which was recognized. Stockholders as well as the public take notice of the new success.",
			"The company experiences a new period of increased motivation and progress due to the innovation which was recognized. Stockholders as well as the public take notice of the new success.",
			"Employee morale is low and employees are unhappy with returning to the workplace. New buildings had to be rented to support all the returning employees.",
			"Productivity remains low and quotas are not met for the first time in a few years. The board is unhappy with your decision.",
			"Productivity increases and the majority of your employees are happy to continue working at home. The board is happy with your decision."
		],
		"graphs": [
			0, 0, 0, 0, 15, 14, 13, 0, 15, 14, 0, 0, 0, 0, 2, 1, 0, 9, 0, 7
		],
		"profiteffects": [
			-0.2, -0.2, -0.2, 0.05, 0.05, 0.05, 0.25, 0, 0, 0, 0, 0.04, 0.05, 0, 0, -0.05, 0.1, 0, 0.1, 0, 0, 0.06, 0.03, 0, 0.04, 0, 0, 0.08, 0, 0, -0.1, -0.1, -0.1, 0.15, 0.15, 0.15, -0.03, -0.03, 0.03
		],
		"stakeholdereffects": [
			-0.4, -0.4, -0.4, 0.25, 0.25, 0.25, -0.02, -0.1, 0, 0.15, -0.2, 0.05, 0.1, -0.05, 0, -0.15, 0.1, 0, 0.05, -0.05, 0, 0.15, -0.1, 0, 0.08, -0.05, 0, 0.1, -0.05, 0, -0.05, -0.05, -0.05, 0.2, 0.2, 0.2, -0.03, -0.05, 0.05
		],
		"publicimgeffects": [
			-0.4, -0.4, -0.4, -0.05, -0.05, -0.05, -0.02, 0.15, 0, 0, 0, 0.02, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.05, -0.05, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.01, 0.01, 0.01, 0, 0, 0
		]
	}
}